In [5]:
import pandas as pd

In [6]:
data = {
    'name': ['Andy', 'Jose', 'Dieu', 'Chloe', 'Jose'],
    'continent': ['America', 'Europe', 'Asia', 'America', 'Europe'],
    'college': ['Lib Arts', 'Business', 'Engineering', 'Engineering', 'Business']
}

In [7]:
students_df = pd.DataFrame(data)
students_df.head(5)

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

### A) Write R or Pandas code to de-dup STUDENTS:

In [11]:
students_df = students_df.drop_duplicates()
students_df.head(5)

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

### B) Create a data frame COUNTS storing the count of students for each continent, college pair

In [15]:
counts_df = (
    students_df.groupby(['continent', 'college'])
    .size()
    .unstack(fill_value=0)
)
counts_df.head(5)

continent    America  Asia  Europe
college
Business           0     0       1
Engineering        1     1       0
Lib Arts           1     0       0